export let items = [
  {
    id: 1,
    name: "[HMR] Cannot apply update. Need to do a full reload!",
    date: 1514704590000,
    content:
      "Односвязный список – это структура данных, которая состоит из элементов, каждый из которых хранит ссылку на следующий. Последний элемент может не иметь ссылки, либо она равна null."
  },
  {
    id: 2,
    name: "[WDS] Disconnected!",
    date: 1514704890000,
    content:
      "При выполнении этого кода всплывет предупреждение о том, что для элементов списка требуется ключ. «Key» — это специальный строковый атрибут, который нужно включить при создании списков элементов. В следующем разделе мы расскажем, почему он так важен."
  },
  {
    id: 3,
    name:
      "Здесь определен компонент ClickButton, который по сути представляет кнопку",
    date: 1514706590000,
    content:
      "Этот код заносит [2, 4, 6, 8, 10] в консоль. В React преобразование массивов устройств в списки элементов происходит аналогичным образом."
  },
  {
    id: 4,
    name:
      "Для начала, давайте рассмотрим, как преобразовать списки в JavaScript",
    date: 1514714590000,
    content:
      "Мы контролируем не только равномерность по наполнению, но и форму факела распыляемого топлива. Для бензиновых форсунок критичным параметром, позволяющим определить необходимость промывки, является время впрыска и состояние топливной смеси."
  },
  {
    id: 5,
    name: "Запотеть катку",
    date: 1514703590000,
    content:
      "Ключи, используемые в массивах устройств должны быть уникальными среди своих братьев. Тем не менее, они не должны быть абсолютно уникальным. Можно использовать одни и те же ключи, при создании двух разных массивов."
  }
];
