export let ItemsStorage = {
  fields: {
    id: { type: "number", name: "№" },
    name: { type: "string", name: "Заголовок" },
    date: { type: "date", name: "Дата добавления" },
    date2: { type: "date", name: "Дедлайн" },
    content: { type: "string", name: "Задача" }
  },
  items: [
    {
      id: 1,
      state: 60,
      name: "[HMR] Cannot apply update. Need to do a full reload!",
      date: 1514704590000,
      date2: 151484590000,
      content:
        "Односвязный список – это структура данных, которая состоит из элементов, каждый из которых хранит ссылку на следующий. Последний элемент может не иметь ссылки, либо она равна null."
    },
    {
      id: 25,
      state: 80,
      name: "Табурет-стремянка М91.13",
      date: 1511704590000,
      date2: 151384590000,
      content:
        "Табурет стремянка модели М91.13 отлично подойдет для дома и для дачи, как замена обычного табурета и обычной стремянки: дешевле купить один табурет стремянку, с помощью которой можно достать что-то с верхних полок или поправить шторы, чем покупать все по отдельности.Табурет стремянка М91.13 сделан из сосны, верх покрыт светлым лаком, а низ покрыт более темной морилкой."
    },
    {
      id: 2,
      state: 50,
      name: "[WDS] Disconnected!",
      date: 1514704890000,
      date2: 1516704890000,
      content:
        "При выполнении этого кода всплывет предупреждение о том, что для элементов списка требуется ключ. «Key» — это специальный строковый атрибут, который нужно включить при создании списков элементов. В следующем разделе мы расскажем, почему он так важен."
    },
    {
      id: 3,
      state: 10,
      name:
        "Здесь определен компонент ClickButton, который по сути представляет кнопку",
      date: 1514706590000,
      date2: 1515706590000,
      content:
        "Этот код заносит [2, 4, 6, 8, 10] в консоль. В React преобразование массивов устройств в списки элементов происходит аналогичным образом."
    },
    {
      id: 4,
      state: 70,
      name:
        "Для начала, давайте рассмотрим, как преобразовать списки в JavaScript",
      date: 1514714590000,
      date2: 1514914590000,
      content:
        "Мы контролируем не только равномерность по наполнению, но и форму факела распыляемого топлива. Для бензиновых форсунок критичным параметром, позволяющим определить необходимость промывки, является время впрыска и состояние топливной смеси."
    },
    {
      id: 5,
      state: 100,
      name: "Запотеть катку",
      date: 1514703590000,
      date2: 1514743590000,
      content:
        "Ключи, используемые в массивах устройств должны быть уникальными среди своих братьев. Тем не менее, они не должны быть абсолютно уникальным. Можно использовать одни и те же ключи, при создании двух разных массивов."
    }
  ]
};

ItemsStorage.items.forEach(function(item) {
  Object.defineProperty(item, "state", { enumerable: false });
});
